---
type: GenericForm
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# GenericForm

`Autodesk.Revit.DB.GenericForm` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | IsSolid | — | `public bool IsSolid { get ; }` |
| Property | Name | — | `public override string Name { set ; }` |
| Property | Parameter | — | `` |
| Property | Subcategory | — | `public Category Subcategory { get ; set ; }` |
| Property | Visible | — | `public bool Visible { get ; }` |